In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

df_transactions = pd.read_csv('data/mock_transactions.csv', header=0)
df_customers = pd.read_csv('data/mock_customers.csv', header=0)

#### Accessing the datasets

In [2]:
df_transactions.shape

(20, 5)

In [3]:
df_transactions.head()  # .tail()

   InvoiceNo  Quantity InvoiceDate  UnitPrice  CustomerID
0     536365         2    01-12-19        NaN       17850
1     536365         6    01-12-19       3.39       17850
2     536365         6    01-12-19       4.25       17850
3     536366         6    01-12-19       1.85       17850
4     536366         6    01-12-19       1.85       17850

In [4]:
df_customers.shape

(8, 4)

In [5]:
df_customers.head()

   CustomerID       Customer Name Gendar                         Email
0       17850  Christopher Hudson      M  Christopher.Hudson@email.com
1       13047         Stacy Davis      F         Stacy.Davis@email.com
2       18263         Alisha Gray      F         Alisha.Gray@email.com
3       15932      Joseph Bennett      M      Joseph.Bennett@email.com
4       14527     Jessica Aguilar      F     Jessica.Aguilar@email.com

### Joining

In [6]:
df_combined = df_transactions.merge(right=df_customers, how='left', on='CustomerID')
print(df_combined.shape)
df_combined.head()

(20, 8)

,InvoiceNo,Quantity,InvoiceDate,UnitPrice,CustomerID,Customer Name,Gendar,Email
0,536365,2,01-12-19,NaN,17850,Christopher Hudson,M,Christopher.Hudson@email.com
1,536365,6,01-12-19,3.39,17850,Christopher Hudson,M,Christopher.Hudson@email.com
2,536365,6,01-12-19,4.25,17850,Christopher Hudson,M,Christopher.Hudson@email.com
3,536366,6,01-12-19,1.85,17850,Christopher Hudson,M,Christopher.Hudson@email.com
4,536366,6,01-12-19,1.85,17850,Christopher Hudson,M,Christopher.Hudson@email.com